#### Note   
In all cases, use only `con.execute` feature and not dataframes.

##### Create database   
In your folder, create a database named 0101a_lab_\<your folder name>.sqlite

In [16]:
import pandas as pd
import os
import sqlite3 as lite
from glob import glob

dbpath = '0101a_lab_reethurgt.sqlite'
con = lite.connect(dbpath)

##### Create tables  
Create tables referring to the spreadsheets in Assignments folder for columns names   
- 'Books' using bookset.xlsx   
- 'Users' using userset.xlsx   
- 'Ratings' using ratingset.xlsx

In [17]:
df1 = pd.read_excel("/Users/reethu/coding/college/DBMS/Assignments/bookset.xlsx")
df1

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,1841721522,New Vegetarian: Bold and Beautiful Recipes for...,Celia Brooks Brown,2001,Ryland Peters and Small Ltd
2,375759778,Prague : A Novel,ARTHUR PHILLIPS,2003,Random House Trade Paperbacks
3,425163091,Chocolate Jesus,Stephan Jaramillo,1998,Berkley Publishing Group

In [18]:
df2= pd.read_excel("/Users/reethu/coding/college/DBMS/Assignments/ratingset.xlsx")
df2

   User-ID        ISBN  Book-Rating
0        2   195153448            0
1       10  1841721522            0
2       10  8477024456            6
3       19   375759778            7
4       20   425163091            0

In [19]:
df3=pd.read_excel("/Users/reethu/coding/college/DBMS/Assignments/userset.xlsx")
df3

   User-ID                                Location  Age
0        2               stockton, california, usa   18
1        4               porto, v.n.gaia, portugal   17
2        6           santa monica, california, usa   61
3       10              albacete, wisconsin, spain   26
4       11          melbourne, victoria, australia   14
5       13             barcelona, barcelona, spain   26
6       18  rio de janeiro, rio de janeiro, brazil   25
7       19                               weston, ,   14
8       20            langhorne, pennsylvania, usa   19

In [20]:
df1.to_sql('BOOKS', con, index=False)
df2.to_sql('RATINGS', con, index=False)
df3.to_sql('USERS', con, index=False)

9

Verify

In [21]:
con.execute("SELECT * from books").fetchall()

[(195153448,
  'Classical Mythology',
  'Mark P. O. Morford',
  2002,
  'Oxford University Press'),
 (1841721522,
  'New Vegetarian: Bold and Beautiful Recipes for Every Occasion',
  'Celia Brooks Brown',
  2001,
  'Ryland Peters and  Small Ltd'),
 (375759778,
  'Prague : A Novel',
  'ARTHUR PHILLIPS',
  2003,
  'Random House Trade Paperbacks'),
 (425163091,
  'Chocolate Jesus',
  'Stephan Jaramillo',
  1998,
  'Berkley Publishing Group')]

In [22]:
con.execute("SELECT * from users").fetchall()

[(2, 'stockton, california, usa', 18),
 (4, 'porto, v.n.gaia, portugal', 17),
 (6, 'santa monica, california, usa', 61),
 (10, 'albacete, wisconsin, spain', 26),
 (11, 'melbourne, victoria, australia', 14),
 (13, 'barcelona, barcelona, spain', 26),
 (18, 'rio de janeiro, rio de janeiro, brazil', 25),
 (19, 'weston, ,', 14),
 (20, 'langhorne, pennsylvania, usa', 19)]

In [23]:
con.execute("SELECT * from ratings").fetchall()

[(2, 195153448, 0),
 (10, 1841721522, 0),
 (10, 8477024456, 6),
 (19, 375759778, 7),
 (20, 425163091, 0)]

##### Insert Data  
  
1. Insert a row each with con.execute.   
	Verify   
2. Delete these rows from the tables.   
    Verify   
3. Insert all the rows in each of the tables using con.executemany    
	Verify  
4. Delete the rows from all the tables. 	   
	Verify    
5. Create one text file with script to insert every row	in the three tables.   
6. Using one con.executescript, insert rows into all the three tables    
	Verify

Inserting rows

In [24]:
con.execute("INSERT INTO BOOKS VALUES(912347658, 'Pride & Prejudice', 'Mark Anthony', 2023, 'Oxford University Press')")

In [25]:
con.execute("SELECT * from books").fetchall()

[(195153448,
  'Classical Mythology',
  'Mark P. O. Morford',
  2002,
  'Oxford University Press'),
 (1841721522,
  'New Vegetarian: Bold and Beautiful Recipes for Every Occasion',
  'Celia Brooks Brown',
  2001,
  'Ryland Peters and  Small Ltd'),
 (375759778,
  'Prague : A Novel',
  'ARTHUR PHILLIPS',
  2003,
  'Random House Trade Paperbacks'),
 (425163091,
  'Chocolate Jesus',
  'Stephan Jaramillo',
  1998,
  'Berkley Publishing Group'),
 (912347658,
  'Pride & Prejudice',
  'Mark Anthony',
  2023,
  'Oxford University Press')]

In [28]:
query = """ INSERT INTO USERS VALUES(?, ?, ?) """

con.execute(query, (123456, 'Bangalore', 25))
con.commit

In [31]:
con.execute("SELECT * from USERS where Location='Bangalore'").fetchall()

[(123456, 'Bangalore', 25)]

In [34]:
query = """ INSERT INTO RATINGS VALUES(15, 977654321, 3) """

con.execute(query).fetchall()
con.commit

In [37]:
con.execute("SELECT * from ratings").fetchall()

[(2, 195153448, 0),
 (10, 1841721522, 0),
 (10, 8477024456, 6),
 (19, 375759778, 7),
 (20, 425163091, 0)]

Delete rows

In [38]:
con.execute("SELECT * from USERS").fetchall()

[(2, 'stockton, california, usa', 18),
 (4, 'porto, v.n.gaia, portugal', 17),
 (6, 'santa monica, california, usa', 61),
 (10, 'albacete, wisconsin, spain', 26),
 (11, 'melbourne, victoria, australia', 14),
 (13, 'barcelona, barcelona, spain', 26),
 (18, 'rio de janeiro, rio de janeiro, brazil', 25),
 (19, 'weston, ,', 14),
 (20, 'langhorne, pennsylvania, usa', 19),
 (123456, 'Bangalore', 25),
 (12, '987654321', 3),
 (12, '987654321', 3),
 (15, '977654321', 3)]

In [42]:
con.execute("DELETE FROM USERS WHERE AGE = 3")

In [43]:
con.execute("SELECT * from USERS").fetchall()

[(2, 'stockton, california, usa', 18),
 (4, 'porto, v.n.gaia, portugal', 17),
 (6, 'santa monica, california, usa', 61),
 (10, 'albacete, wisconsin, spain', 26),
 (11, 'melbourne, victoria, australia', 14),
 (13, 'barcelona, barcelona, spain', 26),
 (18, 'rio de janeiro, rio de janeiro, brazil', 25),
 (19, 'weston, ,', 14),
 (20, 'langhorne, pennsylvania, usa', 19),
 (123456, 'Bangalore', 25)]

Inserting all rows using con.executemany()